Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/kata/go-httpd/target_count_13/repeat_3/13.txt
2020/01/21 06:40:59 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8013/
2020/01/21 06:41:30 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Finished 162642 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8013
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.002 seconds
Complete requests:      162642
Failed requests:        0
Total transferred:      23260666 bytes
HTML transferred:       4229212 bytes
Requests per second:    5421.02 [#/sec] (mean)
Time per request:       18.447 [ms] (mean)
Time per request:       0.184 [ms] (mean, across all concurrent requests)
{"connect":{"max":1076,"mean":12,"median":3,"min":0,"stdDev":89.19999694824219},"percentiles":{"100":1345,"50":6,"66":9,"75":10,"80":12,"90":19,"95":31,"98":57,"99":240},"processing":{"max":668,"mean":7,"median":4,"min":0,"stdDev":15.899999618530273},"total":{"max":1345,"mean":18,"median":6,"min":0,"stdDev":91.4000015258789},"waiting":{"max":668,"mean":6,"median":4,"min":0,"stdDev":15.5}}
Transfer rate:          757.13 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  89.2      3    1076
Processing:     0    7  15.9      4     668
Waiting:        0    6  15.5      4     668
Total:          0   18  91.4      6    1345
Percentage of the requests served within a certain time (ms)
  50%      6
  66%      9
  75%     10
  80%     12
  90%     19
  95%     31
  98%     57
  99%    240
 100%   1345 (longest request)
2020/01/21 06:41:30 Matched stat line [Connect:        0   12  89.2      3    1076 Connect 0 12 89.2 3 1076]
2020/01/21 06:41:30 Matched stat line [Processing:     0    7  15.9      4     668 Processing 0 7 15.9 4 668]
2020/01/21 06:41:30 Matched stat line [Waiting:        0    6  15.5      4     668 Waiting 0 6 15.5 4 668]
2020/01/21 06:41:30 Matched stat line [Total:          0   18  91.4      6    1345 Total 0 18 91.4 6 1345]
2020/01/21 06:41:30 Matched percentline [  50%      6 50 6]
2020/01/21 06:41:30 Matched percentline [  66%      9 66 9]
2020/01/21 06:41:30 Matched percentline [  75%     10 75 10]
2020/01/21 06:41:30 Matched percentline [  80%     12 80 12]
2020/01/21 06:41:30 Matched percentline [  90%     19 90 19]
2020/01/21 06:41:30 Matched percentline [  95%     31 95 31]
2020/01/21 06:41:30 Matched percentline [  98%     57 98 57]
2020/01/21 06:41:30 Matched percentline [  99%    240 99 240]
2020/01/21 06:41:30 Matched percentline [ 100%   1345 100 1345]